app/controllers/group_memberships_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "jim@gmail.com"]]
INSERT INTO "users" ("email", "encrypted_password", "invitation_token", "invitation_created_at", "invitation_sent_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @group = Group.find(params[:group_membership][:group_id])
    email = params[:group_membership][:email]
    usr = User.find_by(email: email)
    if usr
      begin
        @group.add(usr)
      rescue
        flash[:alert] = "Member is already user"
      else
        # Invite the user
        # Remember the user to join the group after adding to group
        flash[:notice] = "Member added successfully"
      end
    else
      if email.match(Devise.email_regexp)
        invited_user = User.invite!(:email => email)
        invited_user.invited_group = @group
        invited_user.save!