app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "group_memberships" ON "groups"."id" = "group_memberships"."group_id" WHERE "group_memberships"."user_id" = ?  [["user_id", 1]]
---
  def index
    @group = current_user.groups

INSERT INTO "groups" ("name", "description", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hackers"], ["description", "Code is the new literacy"], ["admin_id", 1], ["created_at", "2015-12-02 11:54:27.079087"], ["updated_at", "2015-12-02 11:54:27.079087"]]
---
  def create
    @group = Group.new(group_params)
    @group.admin = current_user
    if @group.save